[7025_IT_2025-04-14.txt](https://github.com/user-attachments/files/19744976/7025_IT_2025-04-14.txt)

## TF plan for `dev.shared`

```
Terraform will perform the following actions:

  # aws_wafv2_regex_pattern_set.blocked_user_agents will be created
  + resource "aws_wafv2_regex_pattern_set" "blocked_user_agents" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "azul-blocked_user_agents-dev"
      + scope      = "REGIONAL"
      + tags       = {
          + "Name"                = "azul-blocked_user_agents"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all   = {
          + "Name"                = "azul-blocked_user_agents"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
    }

  # aws_wafv2_regex_pattern_set.blocked_user_agents_custom will be created
  + resource "aws_wafv2_regex_pattern_set" "blocked_user_agents_custom" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "azul-blocked_user_agents_custom-dev"
      + scope      = "REGIONAL"
      + tags       = {
          + "Name"                = "azul-blocked_user_agents_custom"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents_custom"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all   = {
          + "Name"                = "azul-blocked_user_agents_custom"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents_custom"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
    }
…
```

## TF plan for `daniel.local`

(with Regex pattern sets `azul-blocked_user_agents-dev` and `azul-blocked_user_agents_custom-dev` manually created (temporarily) on `dev`)

```
Terraform will perform the following actions:
…

  # aws_wafv2_web_acl.api_gateway will be updated in-place
…

      + rule {
          + name     = "BlockedUserAgents"
          + priority = 2

          + action {
              + block {
                }
            }

          + statement {
              + or_statement {
                  + statement {
                      + regex_pattern_set_reference_statement {
                          + arn = "arn:aws:wafv2:us-east-1:122796619775:regional/regexpatternset/azul-blocked_user_agents-dev/2af64e65-f1ef-4da1-835f-95d0afc0ece8"

                          + field_to_match {
                              + single_header {
                                  + name = "user-agent"
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + regex_pattern_set_reference_statement {
                          + arn = "arn:aws:wafv2:us-east-1:122796619775:regional/regexpatternset/azul-blocked_user_agents_custom-dev/d60aafc2-790f-44d4-a294-8d32166a3e2f"

                          + field_to_match {
                              + single_header {
                                  + name = "user-agent"
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlockedUserAgents"
              + sampled_requests_enabled   = true
            }
        }
…
```